
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбщегоНазначениеКлиент.УбратьСКонцовПробелы(Объект.Наименование);
	
	СоздатьКаталогЦели();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКаталогЦели()
	КаталогПроекта = ОбщегоНазначениеСервер.ПолучитьКаталогПроекта(Объект.Владелец);
	
	ИмяКаталога = КаталогПроекта + "\features\" +  Объект.Наименование;
	
	НачатьСозданиеКаталога(Новый ОписаниеОповещения("СозданиеКаталогаЦелиЗавершение", ЭтотОбъект), ИмяКаталога);
КонецПроцедуры

&НаКлиенте
Процедура СозданиеКаталогаЦелиЗавершение(ИмяКаталога, ДополнительныеПараметры) Экспорт
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Создан каталог цели";
	Сообщение.Сообщить();	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВCSV(Команда)
	Адрес = "";
	
	ВыгрузитьВCSVНаСервере(Адрес);
	
	Если Не ПустаяСтрока(Адрес) Тогда
		ПолучитьФайл(Адрес, Объект.Наименование + ".csv");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВCSVНаСервере(Адрес) 
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".csv");
	
	ВыполнитьВыгрузитьВCSV(ИмяВременногоФайла);

	Файл = Новый Файл(ИмяВременногоФайла);
	Если Файл.Существует() Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		УдалитьФайлы(ИмяВременногоФайла);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузитьВCSV(ИмяВременногоФайла)
	Писатель = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста.UTF8);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользовательскиеИстории.Владелец.Наименование КАК ЦельПроекта,
	|	ПользовательскиеИстории.Наименование КАК Заголовок,
	|	ПользовательскиеИстории.Роль,
	|	ПользовательскиеИстории.КлючевоеДействие,
	|	ПользовательскиеИстории.НеобходимыйФункционал
	|ИЗ
	|	Справочник.ПользовательскиеИстории КАК ПользовательскиеИстории
	|ГДЕ
	|	ПользовательскиеИстории.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Писатель.ЗаписатьСтроку("ЦельПроекта,Заголовок,Роль,КлючевоеДействие,НеобходимыйФункционал");

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = "";
		
		НоваяСтрока = НоваяСтрока + ","  + ОбщегоНазначениеСервер.ОбернутьВКавычки(ВыборкаДетальныеЗаписи.ЦельПроекта);
		НоваяСтрока = НоваяСтрока + ","  + ОбщегоНазначениеСервер.ОбернутьВКавычки(ВыборкаДетальныеЗаписи.Заголовок);
		НоваяСтрока = НоваяСтрока + ","  + ОбщегоНазначениеСервер.ОбернутьВКавычки(ВыборкаДетальныеЗаписи.Роль);
		НоваяСтрока = НоваяСтрока + ","  + ОбщегоНазначениеСервер.ОбернутьВКавычки(ВыборкаДетальныеЗаписи.КлючевоеДействие);
		НоваяСтрока = НоваяСтрока + ","  + ОбщегоНазначениеСервер.ОбернутьВКавычки(ВыборкаДетальныеЗаписи.НеобходимыйФункционал);

		НоваяСтрока = Сред(НоваяСтрока, 2);
		
		Писатель.ЗаписатьСтроку(НоваяСтрока);
	КонецЦикла;

	Писатель.Закрыть();
КонецПроцедуры
