Функция ПолучитьBase64Логин()
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
    ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла);
    ЗаписьТекста.Записать(Логин + ":" + Пароль);
    ЗаписьТекста.Закрыть();

	СтрокаДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Base64Строка(СтрокаДвоичныеДанные);
	
КонецФункции

Функция СписокПространств()

	СтруктураВызова = ПомощникВызоваСервисов.СтруктураURI("https://" + Организация + ".kaiten.io/api/v1/spaces/");
	
	HTTPСоединение = Новый HTTPСоединение(структураВызова.Хост, структураВызова.Порт, Логин, Пароль,
		, , Новый ЗащищенноеСоединениеOpenSSL( неопределено, неопределено )); 
	 
	HTTPЗапрос = Новый HTTPЗапрос(структураВызова.ПутьНаСервере);
	
	Попытка
		Результат =  HTTPСоединение.Получить(HTTPЗапрос);
		ПомощникВызоваСервисов.ОбработатьОшибкиРезультатаВызова(Результат); 
	Исключение
		 ВызватьИсключение "Произошла сетевая ошибка! Событие получение 
		 |" + структураВызова + "
		 |" + ОписаниеОшибки();
	КонецПопытки;
	 
	ОтветСервера = Результат.ПолучитьТелоКакСтроку(); 
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветСервера);
	
	ОбъектДанных = ПрочитатьJSON(ЧтениеJSON);

	Простраства.Очистить();
	Для каждого элемент из ОбъектДанных Цикл
		СтрокаПространства = Простраства.Добавить();
		строкаПространства.Идентификатор =  элемент.id;
		строкаПространства.Наименование = элемент.title;
		строкаПространства.ОбъектСтруктура = элемент;
	КонецЦикла;
	
КонецФункции

Процедура ЗаполнитьДоски(СтруктураПространства)
	
	СтруктураВызова = ПомощникВызоваСервисов.СтруктураURI("https://" + Организация 
			+ ".kaiten.io/api/v1/spaces/" + Формат(структураПространства, "ЧРГ=' '; ЧГ=0") + "/boards/");
	
	HTTPСоединение = Новый HTTPСоединение(структураВызова.Хост, структураВызова.Порт, Логин, Пароль,
		, , Новый ЗащищенноеСоединениеOpenSSL( неопределено, неопределено )); 
	 
	HTTPЗапрос = Новый HTTPЗапрос(структураВызова.ПутьНаСервере);
	
	Попытка
		Результат =  HTTPСоединение.Получить(HTTPЗапрос);
		ПомощникВызоваСервисов.ОбработатьОшибкиРезультатаВызова(Результат); 
	Исключение
		 // исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
		 ВызватьИсключение "Произошла сетевая ошибка! Событие получение 
		 |" + структураВызова + "
		 |" + ОписаниеОшибки();
	КонецПопытки;
	 
	ОтветСервера = Результат.ПолучитьТелоКакСтроку(); 
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветСервера);
	
	ОбъектДанных = ПрочитатьJSON(ЧтениеJSON);

	ДеревоПространства = Новый ДеревоЗначений;
	ДеревоПространства.Колонки.Добавить("ДоскаID");
	ДеревоПространства.Колонки.Добавить("ДоскаНаименование");
	ДеревоПространства.Колонки.Добавить("КарточкаID");
	ДеревоПространства.Колонки.Добавить("КарточкаНаименование");
	
	Для каждого Доска из ОбъектДанных Цикл	
		
		ДоскаКорень = ДеревоПространства.Строки.Добавить();
		ДоскаКорень.ДоскаID = Доска.id;
		ДоскаКорень.ДоскаНаименование = Доска.title;
		
		КарточкиДоски = ПолучитьКарточкиДоски(Доска.id);
		
		Для Каждого карточка из карточкиДоски Цикл
			
			КарточкаУзел = ДоскаКорень.Строки.Добавить();
			карточкаУзел.КарточкаID = карточка.id;
			карточкаУзел.КарточкаНаименование = карточка.title;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ДеревоПространства, ДеревоКарточек);
	
КонецПроцедуры

Функция ПолучитьКарточкиДоски(ИдДоски)
	
	СтруктураВызова = ПомощникВызоваСервисов.СтруктураURI("https://" + Организация 
			+ ".kaiten.io/api/v1//cards?board_id=" + ИдДоски);
	
	HTTPСоединение = Новый HTTPСоединение(структураВызова.Хост, структураВызова.Порт, Логин, Пароль,
		, , Новый ЗащищенноеСоединениеOpenSSL( неопределено, неопределено )); 
	 
	HTTPЗапрос = Новый HTTPЗапрос(структураВызова.ПутьНаСервере);
	
	Попытка
		Результат =  HTTPСоединение.Получить(HTTPЗапрос);
		ПомощникВызоваСервисов.ОбработатьОшибкиРезультатаВызова(Результат); 
	Исключение
		 // исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
		 ВызватьИсключение "Произошла сетевая ошибка! Событие получение 
		 |" + структураВызова + "
		 |" + ОписаниеОшибки();
	КонецПопытки;
	 
	ОтветСервера = Результат.ПолучитьТелоКакСтроку(); 
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветСервера);
	
	ОбъектДанных = ПрочитатьJSON(ЧтениеJSON);

	Возврат ОбъектДанных;
	
КонецФункции

&НаСервере
Процедура ВойтиНаСервере()
	
	СписокПространств();
	
КонецПроцедуры

&НаКлиенте
Процедура Войти(Команда)
	ВойтиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОткрытьПространствоНаСервере()
	
	ЭлементМассива = Элементы.Простраства.ТекущаяСтрока;
	
	Если ЭлементМассива >= 0 И ЭлементМассива <= Простраства.Количество() Тогда
		ТекущийЭлементПространства = Простраства[Элементы.Простраства.ТекущаяСтрока];	
		
		ЗаполнитьДоски(текущийЭлементПространства.Идентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПространство(Команда)
	ОткрытьПространствоНаСервере();
КонецПроцедуры
