
Функция ПолучитьКаталогПроекта(Проект) Экспорт
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Проекты.КаталогПроекта
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	Проекты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат = ВыборкаДетальныеЗаписи.КаталогПроекта;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьПутьКFeatureФайлу(ПользовательскаяИстория) Экспорт
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользовательскиеИстории.Владелец КАК Владелец,
	|	ПользовательскиеИстории.Наименование + "".feature"" КАК ПутьКFeatureФайлу
	|ПОМЕСТИТЬ ВТПользовательскаяИстория
	|ИЗ
	|	Справочник.ПользовательскиеИстории КАК ПользовательскиеИстории
	|ГДЕ
	|	ПользовательскиеИстории.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦелиПроекта.Владелец КАК Владелец,
	|	ЦелиПроекта.Наименование + ""\"" + ВТПользовательскаяИстория.ПутьКFeatureФайлу КАК ПутьКFeatureФайлу
	|ПОМЕСТИТЬ ВТЦелиПроекта
	|ИЗ
	|	ВТПользовательскаяИстория КАК ВТПользовательскаяИстория
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БизнесЦелиПроекта КАК ЦелиПроекта
	|		ПО ВТПользовательскаяИстория.Владелец = ЦелиПроекта.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Проекты.КаталогПроекта + ""\features\"" + ВТЦелиПроекта.ПутьКFeatureФайлу КАК ПутьКFeatureФайлу
	|ИЗ
	|	ВТЦелиПроекта КАК ВТЦелиПроекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
	|		ПО ВТЦелиПроекта.Владелец = Проекты.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПользовательскаяИстория);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат = ВыборкаДетальныеЗаписи.ПутьКFeatureФайлу;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьЗначениеРеквизита(ВидОбъекта, ИмяОбъекта, Ссылка, ИмяРеквизита) Экспорт
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаБазыДанных." + ИмяРеквизита + " КАК Значение
	|ИЗ
	|	" + ВидОбъекта + "." + ИмяОбъекта + " КАК ТаблицаБазыДанных
	|ГДЕ
	|	ТаблицаБазыДанных.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат = ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;

	Возврат Результат;
КонецФункции

Функция ОбернутьВКавычки(Знач Строка) Экспорт
	Если Лев(Строка, 1) = """" и Прав(Строка, 1) = """" Тогда
		Возврат Строка;
	Иначе
		Возврат """" + Строка + """";
	КонецЕсли;
КонецФункции
