
&НаКлиенте
Процедура ЧеткостьПоискаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Направление > 0 Тогда
		ЧеткостьПоиска = ЧеткостьПоиска + 5;
		
	Иначе
		ЧеткостьПоиска = ЧеткостьПоиска - 5;
		
	КонецЕсли;
	
	Если ЧеткостьПоиска < 0 Тогда
		ЧеткостьПоиска = 100;
		
	ИначеЕсли ЧеткостьПоиска > 100 Тогда
		ЧеткостьПоиска = 0;
		
	КонецЕсли;
	
	ВыполнитьПоискНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РезультатПоиска.ТекущиеДанные;
	
	Закрыть(ТекущиеДанные.НайденнаяСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск(Команда)
	ВыполнитьПоискНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискНаСервере() 
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПоискаНаСервере = РеквизитФормыВЗначение("РезультатПоиска");
	
	РезультатПоискаНаСервере.Очистить();
	
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок();
	
	СписокПоиска.СтрокаПоиска = СтрокаПоиска;
	СписокПоиска.ПорогНечеткости = 100 - ЧеткостьПоиска;
	
	ОбластьПоиска = Новый Массив;
	
	ОбластьПоиска.Добавить(Метаданные.Справочники[ИмяСправочника]);
	
	СписокПоиска.ОбластьПоиска = ОбластьПоиска;
	
	РазмерПорции = 10;
	
	СписокПоиска.РазмерПорции = РазмерПорции;
	
	Читаем = Истина;
	
	Попытка
		СписокПоиска.ПерваяЧасть();
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось выполнить поиск первой части.";
		Сообщение.Сообщить();	
		
		Читаем = Ложь;
		
	КонецПопытки;
	
	Счетчик = 0;
	
	Пока Читаем Цикл
		Если СписокПоиска.Количество() = 0 Тогда
			Читаем = Ложь;
		КонецЕсли;
		
		Для Каждого Строка Из СписокПоиска Цикл
			ПоложениеРазделителя = СтрНайти(Строка.Описание, ":");
			Если ПоложениеРазделителя > 0 Тогда
				СинонимИзОписания = Лев(Строка.Описание, ПоложениеРазделителя - 1);
				Если СинонимИзОписания = СинонимПоляПоиска Тогда
					НоваяСтрока = РезультатПоискаНаСервере.Добавить();
					
					НоваяСтрока.НайденнаяСсылка = Строка.Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			СписокПоиска.СледующаяЧасть(Счетчик);
			
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось выполнить поиск следующей части.";
			Сообщение.Сообщить();	
			
			Читаем = Ложь;
			
		КонецПопытки;
		
		Счетчик = Счетчик + РазмерПорции;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(РезультатПоискаНаСервере, "РезультатПоиска");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьСтрокуПоиска(Параметры.ИсходнаяСтрокаПоиска);
	ЗаполнитьДополнительныеПоляПоиска(Отказ);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеПоляПоиска(Отказ)
	ТипЗначенияТекущегоСправочника = ТипЗнч(Параметры.ТекущийСправочник);
	Если Не Справочники.ТипВсеСсылки().СодержитТип(ТипЗначенияТекущегоСправочника) Тогда
		Отказ = Истина;
	КонецЕсли;

	ИмяСправочника = Параметры.ТекущийСправочник.Метаданные().Имя;
	
	Если ТипЗначенияТекущегоСправочника = Тип("СправочникСсылка.ПользовательскиеИстории") Тогда
		СинонимПоляПоиска = "Заголовок";
		
	ИначеЕсли Ложь
		Или ТипЗначенияТекущегоСправочника = Тип("СправочникСсылка.Персоны")
		Или ТипЗначенияТекущегоСправочника = Тип("СправочникСсылка.КлючевыеДействия")
		Или ТипЗначенияТекущегоСправочника = Тип("СправочникСсылка.Функциональности")
		Тогда
		
		СинонимПоляПоиска = "Определение";
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура СформироватьСтрокуПоиска(ИсходнаяСтрокаПоиска)
	ИсходнаяСтрокаПоиска = ОбщегоНазначенияКлиентСервер.УбратьЛишниеПробелыИТабы(ИсходнаяСтрокаПоиска);
	
	Пробел = Новый Структура;
	
	Пробел.Вставить("Обычный", " ");
	Пробел.Вставить("Неразрывный", Символы.НПП);
	
	Оператор = " И "; 
	
	ИсходнаяСтрокаПоиска = СтрЗаменить(ИсходнаяСтрокаПоиска, Пробел.Обычный, Оператор);
	ИсходнаяСтрокаПоиска = СтрЗаменить(ИсходнаяСтрокаПоиска, Пробел.Неразрывный, Оператор);
	
	СтрокаПоиска = ИсходнаяСтрокаПоиска;
КонецПроцедуры
