
&НаКлиенте
Процедура ЧеткостьПоискаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Направление > 0 Тогда
		ЧеткостьПоиска = ЧеткостьПоиска + 5;
		
	Иначе
		ЧеткостьПоиска = ЧеткостьПоиска - 5;
		
	КонецЕсли;
	
	Если ЧеткостьПоиска < 0 Тогда
		ЧеткостьПоиска = 100;
		
	ИначеЕсли ЧеткостьПоиска > 100 Тогда
		ЧеткостьПоиска = 0;

	КонецЕсли;
	
	ВыполнитьПоискНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РезультатПоиска.ТекущиеДанные;
	
	Закрыть(ТекущиеДанные.НайденнаяСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск(Команда)
	ВыполнитьПоискНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискНаСервере() 
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПоискаНаСервере = РеквизитФормыВЗначение("РезультатПоиска");
	
	РезультатПоискаНаСервере.Очистить();

	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок();
	
	СписокПоиска.СтрокаПоиска = СтрокаПоиска;
	СписокПоиска.ПорогНечеткости = 100 - ЧеткостьПоиска;
	
	ОбластьПоиска = Новый Массив;
	
	ОбластьПоиска.Добавить(Метаданные.Справочники[Параметры.ИмяСправочника]);
	
	СписокПоиска.ОбластьПоиска = ОбластьПоиска;
	
	РазмерПорции = 10;
	
	СписокПоиска.РазмерПорции = РазмерПорции;

	Читаем = Истина;
	
	Попытка
		СписокПоиска.ПерваяЧасть();

	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось выполнить поиск первой части.";
		Сообщение.Сообщить();	
		
		Читаем = Ложь;
		
	КонецПопытки;

	Счетчик = 0;
	
	Пока Читаем Цикл
		Если СписокПоиска.Количество() = 0 Тогда
			Читаем = Ложь;
		КонецЕсли;

		Для Каждого Строка Из СписокПоиска Цикл
			НоваяСтрока = РезультатПоискаНаСервере.Добавить();
			
			НоваяСтрока.НайденнаяСсылка = Строка.Значение;
		КонецЦикла;

		Попытка
			СписокПоиска.СледующаяЧасть(Счетчик);

		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось выполнить поиск следующей части.";
			Сообщение.Сообщить();	
			
			Читаем = Ложь;
			
		КонецПопытки;
		
		Счетчик = Счетчик + РазмерПорции;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(РезультатПоискаНаСервере, "РезультатПоиска");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИсходнаяСтрокаПоиска") Тогда
		СформироватьСтрокуПоиска(Параметры.ИсходнаяСтрокаПоиска);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьСтрокуПоиска(ИсходнаяСтрокаПоиска)
	ИсходнаяСтрокаПоиска = ОбщегоНазначенияКлиентСервер.УбратьЛишниеПробелыИТабы(ИсходнаяСтрокаПоиска);
	
	Пробел = Новый Структура;
	
	Пробел.Вставить("Обычный", " ");
	Пробел.Вставить("Неразрывный", Символы.НПП);

	Оператор = " И "; 

	ИсходнаяСтрокаПоиска = СтрЗаменить(ИсходнаяСтрокаПоиска, Пробел.Обычный, Оператор);
	ИсходнаяСтрокаПоиска = СтрЗаменить(ИсходнаяСтрокаПоиска, Пробел.Неразрывный, Оператор);
	
	СтрокаПоиска = ИсходнаяСтрокаПоиска;
КонецПроцедуры