
&НаКлиенте
Процедура КаталогПроектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	
	ДиалогВыбораКаталога.Показать(Новый ОписаниеОповещения("ВыборКаталогаПроектаЗавершение", ЭтотОбъект))
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаПроектаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если Ложь
		Или ВыбранныеФайлы <> Неопределено
		Или ВыбранныеФайлы.Количество() > 0
		Тогда
		
		Объект.КаталогПроекта = ВыбранныеФайлы[0];
	КонецЕсли;
КонецПроцедуры
