
Процедура ПередЗаписью(Отказ)
	ПроверитьУникальностьНомераIssue(Отказ);
КонецПроцедуры

Процедура ПроверитьУникальностьНомераIssue	(Отказ)
	Если Ложь
		Или Отказ
		Или НомерIssue = 0
		Тогда
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПользовательскиеИстории.Ссылка
	|ИЗ
	|	Справочник.ПользовательскиеИстории КАК ПользовательскиеИстории
	|ГДЕ
	|	ПользовательскиеИстории.НомерIssue = &НомерIssue
	|	И ПользовательскиеИстории.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("НомерIssue", НомерIssue);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	НомерIssue = 0;
	ИмяFeatureФайла = "";
КонецПроцедуры
