
Процедура ПриКопировании(ОбъектКопирования)
	ОчиститьРеквизитыПриКопировании();
КонецПроцедуры

Процедура ОчиститьРеквизитыПриКопировании() 
	ПутьКФиче = "";
	Ценность = Неопределено;
	ОбъемРабот = Неопределено;
	БизнесВес = 0;
	НомерФичи = "";
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ОпределитьНомерФичи();
	ОпределитьПутьКФиче();
КонецПроцедуры

Процедура ОпределитьНомерФичи() 
	НомерФичи = XMLСтрока(Код);
КонецПроцедуры

Процедура ОпределитьПутьКФиче()
	Если ЗначениеЗаполнено(ПутьКФиче) Тогда
		Возврат;
	КонецЕсли;
	
	КаталогПроекта = ОбщегоНазначенияСервер.ПолучитьКаталогПроекта(Владелец);
	ИмяФичи = ОбщегоНазначенияКлиентСервер.ПолучитьИмяПеременнойИзСтроки(Заголовок);
	Расширение = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеФичи();
	
	ПутьКФиче = КаталогПроекта + "\" + ИмяФичи + Расширение;
КонецПроцедуры
